"""
Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, 
а некоторые – гербом. Определите минимальное число монеток, которые нужно 
перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной. 
Выведите минимальное количество монет, которые нужно перевернуть
"""
n = int(input("Введите общее число монеток: "))
eagle = 0
tails = 0 
for i in range(n):
    side = int(input("Если монетка лежит орлом, введите '1' если решкой '0': "))
    
    if side:
        eagle += 1
    else:
        tails += 1
if eagle > tails:
    print (tails)
else:
    print(eagle)